[
  {
    "id": 1,
    "name": "Pet Mind",
    "categories": ["App", "Group"],
    "description": "<p>PetMind is an innovative web platform designed to connect pet owners with reliable and trusted pet minders in their locality. This project aimed to simplify the process of finding and booking professional pet care services, ensuring peace of mind for pet owners and high-quality care for pets.</p><p>Key Contributions:</p><p>Search Functionality for the Prototype:</p><ul><li>Designed and implemented the core search feature, enabling users to find pet minders based on location, availability, and services offered.</li><li>Integrated advanced filtering options to enhance user experience and streamline the search process.</li></ul><p>Research and Planning:</p><ul><li>Conducted comprehensive research to identify user needs and market gaps, ensuring the platform meets the demands of both pet owners and pet minders.</li><li>Developed detailed user personas and scenarios to guide the design and functionality of the website.</li></ul><p>UML Diagrams and System Design:</p><ul><li>Created extensive UML diagrams including use case diagrams, class diagrams, and sequence diagrams to map out the system architecture.</li><li>Collaborated with the team to translate these diagrams into a functional and efficient website structure.</li></ul> <img src='images/petmind.png'> <img src='images/petmind2.png'>",
    "image": "images/petmind1.png"
  },
  {
    "id": 2,
    "name": "Weather App",
    "categories": ["App", "Group"],
    "description": "<p>This project is a prototype for a specialized weather app designed specifically for climbers. It provides crucial real-time, location-based weather updates to ensure safe and optimal climbing experiences. The focus is on delivering accurate and reliable weather information tailored to the needs of climbers.</p><p>Key Contributions:</p><p>UI/UX Design:</p><ul><li>Led the design phase using Figma, creating a user-centric interface that is intuitive and easy to navigate.</li><li>Developed interactive and visually appealing prototypes, ensuring a seamless user experience focused on the unique requirements of climbers.</li></ul><p>Prototype Development:</p><ul><li>Built the initial prototype using JavaScript, demonstrating core functionalities and interactive elements.</li><li>Integrated the OpenWeather API to fetch and display real-time weather data, ensuring the prototype's accuracy and reliability.</li></ul><p>Core Features Implementation:</p><ul><li>Developed essential features such as weather forecasts, temperature, wind speed, and precipitation details, all tailored for climbing conditions.</li><li>Implemented an intuitive location-based search functionality to help climbers find weather updates for specific climbing spots.</li></ul><p>By leveraging my skills in UI/UX design and web development, I successfully created a weather app prototype aimed at providing climbers with the vital information they need to plan their climbs safely and effectively.</p>",
    "image": "images/weatherApp.png"
  },
  {
    "id": 3,
    "name": "Ospuze",
    "categories": ["Website", "Solo"],
    "description": "<p>Ospuze is a virtual brand in the game 'The Finals'. I created a 3D website for this in-game brand using Spline.</p><p>Key Elements:</p><ul><li>Immersive virtual brand experience.</li><li>Developed using Spline to create engaging 3D visuals and interactions.</li></ul><p>This project explores the creation and integration of a fictional brand within a popular game, enhancing the in-game experience through a dynamic and interactive 3D website.</p> <img src='images/ospuze1.png'> <img src='images/ospuze2.png'>",
    "image": "images/ospuze.png"
  },
  {
    "id": 4,
    "name": "Chat App",
    "categories": ["App", "Solo"],
    "description":"<p>ChatMate is an advanced chat application built with React, designed to deliver a seamless and modern communication experience. This project focuses on providing real-time messaging, user authentication, and an intuitive user interface for effortless interaction.</p><p>Key Features:</p><p>Real-Time Messaging:</p><ul><li>Messages are delivered instantly and reliably.</li></ul><p>User Authentication:</p><ul><li>Created a secure authentication system to protect user data and ensure privacy.</li><li>Incorporated user registration and login functionalities.</li></ul><p>Responsive Design:</p><ul><li>Designed a fully responsive interface to provide a consistent user experience across all devices, including desktops, tablets, and smartphones.</li></ul><p>Group Chats and Media Sharing:</p><ul><li>Enabled users to create and manage group chats, fostering collaboration and social interaction.</li><li>Added media sharing capabilities, allowing users to send photos, videos, and files within chats.</li></ul>",
    "image": "images/ChatApp.png"
  },
  {
    "id": 5,
    "name": "Muted Colour Theme",
    "categories": ["Others", "Solo"],
    "description": "<p>The Muted Colour Theme offers a calming and subtle color palette designed to reduce visual distractions while coding. With muted tones and gentle contrasts, this theme provides a comfortable environment for extended coding sessions.</p><p>Features:</p><ul><li>Reduced Distractions: Muted colors minimize visual noise, allowing you to focus on your code.</li><li>Enhanced Readability: Carefully selected hues ensure clear visibility and comfortable reading.</li><li>Subtle Aesthetics: Soft gradients and gentle contrasts create a pleasant coding experience without overwhelming the senses.</li></ul>",
    "image": "images/muted_theme.png"
  },
  {
    "id": 6,
    "name": "This Website",
    "categories": ["Website", "Solo"],
    "description": "<p>This is my personal website.</p><p>This website was designed using Figma. Developed using HTML, CSS, and JavaScript in Visual Studio Code.</p>",
    "image": "images/thiswebsite.png"
  }
]

